felias-fogg/TinyCore/avr/boards.txt
x61.menu.bootloader.urboot_+250=Yes (F_CPU +2.50%)
x61.menu.bootloader.urboot_+250.upload.protocol=urclock
x61.menu.bootloader.urboot_+250.build.export_merged_output=true
x61.menu.bootloader.urboot_+250.bootloader.str=-Uurboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x61.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+375=Yes (F_CPU +3.75%)
x61.menu.bootloader.urboot_+375.upload.protocol=urclock
x61.menu.bootloader.urboot_+375.build.export_merged_output=true
x61.menu.bootloader.urboot_+375.bootloader.str=-Uurboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x61.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+500=Yes (F_CPU +5.00%)
x61.menu.bootloader.urboot_+500.upload.protocol=urclock
x61.menu.bootloader.urboot_+500.build.export_merged_output=true
x61.menu.bootloader.urboot_+500.bootloader.str=-Uurboot:2s_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x61.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

# EEPROM
x61.menu.eeprom.keep=EEPROM retained
x61.menu.eeprom.keep.bootloader.eesave_bit=0
x61.menu.eeprom.erase=EEPROM not retained
x61.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x61.menu.chip.861=ATtiny861
x61.menu.chip.861.build.mcu=attiny861
x61.menu.chip.861.upload.maximum_size=8192
x61.menu.chip.861.upload.maximum_data_size=512

x61.menu.chip.461=ATtiny461
x61.menu.chip.461.build.mcu=attiny461
x61.menu.chip.461.upload.maximum_size=4096
x61.menu.chip.461.upload.maximum_data_size=256

x61.menu.chip.261=ATtiny261
x61.menu.chip.261.build.mcu=attiny261
x61.menu.chip.261.upload.maximum_size=2048
x61.menu.chip.261.upload.maximum_data_size=128

# Software serial
x61.menu.softserial.rxtx=RX and TX
x61.menu.softserial.rxtx.build.softser=
x61.menu.softserial.tx=TX only
x61.menu.softserial.tx.build.softser=-DSOFT_TX_ONLY

# Brown out detection
x61.menu.bod.2v7=BOD 2.7V
x61.menu.bod.2v7.bootloader.bod_bits=101
x61.menu.bod.4v3=BOD 4.3V
x61.menu.bod.4v3.bootloader.bod_bits=100
x61.menu.bod.1v8=BOD 1.8V
x61.menu.bod.1v8.bootloader.bod_bits=110
x61.menu.bod.disable=BOD disabled
x61.menu.bod.disable.bootloader.bod_bits=111

# Clock frequencies
x61.menu.clock.8MHz_internal=8 MHz internal osc.
x61.menu.clock.8MHz_internal.bootloader.clock=8MHz
x61.menu.clock.8MHz_internal.bootloader.osc=i
x61.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x61.menu.clock.8MHz_internal.bootloader.baudrate=38400
x61.menu.clock.8MHz_internal.build.clocksource=0
x61.menu.clock.8MHz_internal.build.f_cpu=8000000L

x61.menu.clock.16MHz_internal_PLL=16 MHz internal PLL osc.
x61.menu.clock.16MHz_internal_PLL.bootloader.clock=16MHz
x61.menu.clock.16MHz_internal_PLL.bootloader.osc=i
x61.menu.clock.16MHz_internal_PLL.bootloader.low_fuses=0xf1
x61.menu.clock.16MHz_internal_PLL.bootloader.baudrate=115200
x61.menu.clock.16MHz_internal_PLL.build.clocksource=6
x61.menu.clock.16MHz_internal_PLL.build.f_cpu=16000000L

x61.menu.clock.4MHz_internal=4 MHz internal osc.
x61.menu.clock.4MHz_internal.bootloader.clock=4MHz
x61.menu.clock.4MHz_internal.bootloader.osc=i
x61.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x61.menu.clock.4MHz_internal.bootloader.baudrate=9600
x61.menu.clock.4MHz_internal.build.clocksource=0
x61.menu.clock.4MHz_internal.build.f_cpu=4000000L

x61.menu.clock.1MHz_internal=1 MHz internal osc.
x61.menu.clock.1MHz_internal.bootloader.clock=1MHz
x61.menu.clock.1MHz_internal.bootloader.osc=i
x61.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x61.menu.clock.1MHz_internal.bootloader.baudrate=9600
x61.menu.clock.1MHz_internal.build.clocksource=0
x61.menu.clock.1MHz_internal.build.f_cpu=1000000L

x61.menu.clock.128kHz_internal=128 kHz internal osc.
x61.menu.clock.128kHz_internal.bootloader.clock=128kHz
x61.menu.clock.128kHz_internal.bootloader.osc=i
x61.menu.clock.128kHz_internal.bootloader.low_fuses=0xe3
x61.menu.clock.128kHz_internal.bootloader.baudrate=1200
x61.menu.clock.128kHz_internal.build.clocksource=3
x61.menu.clock.128kHz_internal.build.f_cpu=128000L

x61.menu.clock.20MHz_external=20 MHz external osc.
x61.menu.clock.20MHz_external.bootloader.clock=20MHz
x61.menu.clock.20MHz_external.bootloader.osc=x
x61.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.20MHz_external.bootloader.baudrate=115200
x61.menu.clock.20MHz_external.build.clocksource=1
x61.menu.clock.20MHz_external.build.f_cpu=20000000L

x61.menu.clock.18_432MHz_external=18.432 MHz external osc.
x61.menu.clock.18_432MHz_external.bootloader.clock=18.432MHz
x61.menu.clock.18_432MHz_external.bootloader.osc=x
x61.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x61.menu.clock.18_432MHz_external.build.clocksource=1
x61.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x61.menu.clock.16MHz_external=16 MHz external osc.
x61.menu.clock.16MHz_external.bootloader.clock=16MHz
x61.menu.clock.16MHz_external.bootloader.osc=x
x61.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.16MHz_external.bootloader.baudrate=115200
x61.menu.clock.16MHz_external.build.clocksource=1
x61.menu.clock.16MHz_external.build.f_cpu=16000000L

x61.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x61.menu.clock.14_7456MHz_external.bootloader.clock=14.7456MHz
x61.menu.clock.14_7456MHz_external.bootloader.osc=x
x61.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x61.menu.clock.14_7456MHz_external.build.clocksource=1
x61.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x61.menu.clock.12MHz_external=12 MHz external osc.
x61.menu.clock.12MHz_external.bootloader.clock=12MHz
x61.menu.clock.12MHz_external.bootloader.osc=x
x61.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.12MHz_external.bootloader.baudrate=115200
x61.menu.clock.12MHz_external.build.clocksource=1
x61.menu.clock.12MHz_external.build.f_cpu=12000000L

x61.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x61.menu.clock.11_0592MHz_external.bootloader.clock=11.0592MHz
x61.menu.clock.11_0592MHz_external.bootloader.osc=x
x61.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x61.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x61.menu.clock.11_0592MHz_external.build.clocksource=1
x61.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

